xml/request/placeorder.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oo="http://oss.dbc.dk/ns/openorder"><SOAP-ENV:Body>
      <oo:placeOrderRequest>
         <oo:author>?</oo:author>
         <oo:authorOfComponent>?</oo:authorOfComponent>
         <oo:bibliographicCategory>?</oo:bibliographicCategory>
         <oo:bibliographicRecordAgencyId>?</oo:bibliographicRecordAgencyId>
         <oo:bibliographicRecordId>?</oo:bibliographicRecordId>
         <oo:callNumber>?</oo:callNumber>
         <oo:copy>true</oo:copy>
         <oo:edition>?</oo:edition>
         <oo:exactEdition>true</oo:exactEdition>
         <oo:isbn>?</oo:isbn>
         <oo:issn>?</oo:issn>
         <oo:issue>?</oo:issue>
         <oo:itemId>?</oo:itemId>
         <oo:language>?</oo:language>
         <oo:localHoldingsId>?</oo:localHoldingsId>
         <oo:mediumType>book</oo:mediumType>
         <oo:needBeforeDate>2010-10-10</oo:needBeforeDate>
         <oo:orderId>?</oo:orderId>
         <oo:orderSystem>netpunkt</oo:orderSystem>
         <oo:pagination>?</oo:pagination>
         <oo:pickUpAgencyId>?</oo:pickUpAgencyId>
         <oo:placeOfPublication>?</oo:placeOfPublication>
         <oo:publicationDate>?</oo:publicationDate>
         <oo:publicationDateOfComponent>?</oo:publicationDateOfComponent>
         <oo:publisher>?</oo:publisher>
         <oo:seriesTitelNumber>?</oo:seriesTitelNumber>
         <oo:serviceRequester>?</oo:serviceRequester>
         <oo:title>?</oo:title>
         <oo:titleOfComponent>?</oo:titleOfComponent>
         <oo:userAddress>?</oo:userAddress>
         <oo:userAgencyId>?</oo:userAgencyId>
         <oo:userDateOfBirth>?</oo:userDateOfBirth>
         <oo:userId>?</oo:userId>
         <oo:userIdAuthenticated>false</oo:userIdAuthenticated>
         <oo:userIdType>cpr</oo:userIdType>
         <oo:userMail>?</oo:userMail>
         <oo:userName>?</oo:userName>
         <oo:userReferenceSource>?</oo:userReferenceSource>
         <oo:userTelephone>?</oo:userTelephone>
         <oo:verificationReferenceSource>danbib</oo:verificationReferenceSource>
         <oo:volume>?</oo:volume>
      </oo:placeOrderRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
