xml/request/placeOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openorder">
   <soapenv:Header/>
   <soapenv:Body>
      <open:placeOrderRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <!--Optional:-->
         <open:author>?</open:author>
         <!--Optional:-->
         <open:authorOfComponent>?</open:authorOfComponent>
         <!--Optional:-->
         <open:bibliographicCategory>?</open:bibliographicCategory>
         <!--Optional:-->
         <open:bibliographicRecordAgencyId>?</open:bibliographicRecordAgencyId>
         <!--Optional:-->
         <open:bibliographicRecordId>?</open:bibliographicRecordId>
         <!--Optional:-->
         <open:callNumber>?</open:callNumber>
         <!--Optional:-->
         <open:copy>?</open:copy>
         <!--Optional:-->
         <open:edition>?</open:edition>
         <!--Optional:-->
         <open:exactEdition>?</open:exactEdition>
         <!--Optional:-->
         <open:isbn>?</open:isbn>
         <!--Optional:-->
         <open:issn>?</open:issn>
         <!--Optional:-->
         <open:issue>?</open:issue>
         <!--Optional:-->
         <open:itemId>?</open:itemId>
         <!--Optional:-->
         <open:language>?</open:language>
         <!--Optional:-->
         <open:localHoldingsId>?</open:localHoldingsId>
         <!--Optional:-->
         <open:mediumType>?</open:mediumType>
         <open:needBeforeDate>?</open:needBeforeDate>
         <!--Optional:-->
         <open:orderId>?</open:orderId>
         <open:orderSystem>?</open:orderSystem>
         <!--Optional:-->
         <open:pagination>?</open:pagination>
         <!--Optional:-->
         <open:pickUpAgencyId>?</open:pickUpAgencyId>
         <!--Optional:-->
         <open:pickUpAgencySubdivision>?</open:pickUpAgencySubdivision>
         <!--Optional:-->
         <open:placeOfPublication>?</open:placeOfPublication>
         <!--Optional:-->
         <open:publicationDate>?</open:publicationDate>
         <!--Optional:-->
         <open:publicationDateOfComponent>?</open:publicationDateOfComponent>
         <!--Optional:-->
         <open:publisher>?</open:publisher>
         <!--Optional:-->
         <open:requesterId>?</open:requesterId>
         <!--Optional:-->
         <open:requesterNote>?</open:requesterNote>
         <!--Optional:-->
         <open:responderId>?</open:responderId>
         <!--Optional:-->
         <open:seriesTitelNumber>?</open:seriesTitelNumber>
         <open:serviceRequester>?</open:serviceRequester>
         <!--Optional:-->
         <open:title>?</open:title>
         <!--Optional:-->
         <open:titleOfComponent>?</open:titleOfComponent>
         <!--Optional:-->
         <open:userAddress>?</open:userAddress>
         <!--Optional:-->
         <open:userAgencyId>?</open:userAgencyId>
         <!--Optional:-->
         <open:userDateOfBirth>?</open:userDateOfBirth>
         <open:userId>?</open:userId>
         <!--Optional:-->
         <open:userIdAuthenticated>?</open:userIdAuthenticated>
         <!--Optional:-->
         <open:userIdType>?</open:userIdType>
         <!--Optional:-->
         <open:userMail>?</open:userMail>
         <!--Optional:-->
         <open:userName>?</open:userName>
         <!--Optional:-->
         <open:userReferenceSource>?</open:userReferenceSource>
         <!--Optional:-->
         <open:userTelephone>?</open:userTelephone>
         <!--Optional:-->
         <open:verificationReferenceSource>?</open:verificationReferenceSource>
         <!--Optional:-->
         <open:volume>?</open:volume>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:callback>?</open:callback>
      </open:placeOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
